src/cf/DataProcessors/ИсправлениеБанковскихДокументовНаПеречислениеФизЛицам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИсправлениеБанковскихДокументовНаПеречислениеФизЛицам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ВидыОперацийСписаниеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписаниеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПодотчетномуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗаработнойПлатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДепонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручение</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ОтчетКомитентуОПродажах</xr:Item>
				<xr:Item>Document.ОтчетКомиссионераОПродажах</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтПокупателя</xr:Item>
				<xr:Item>Document.ВедомостьНаВыплатуЗарплатыВБанк</xr:Item>
				<xr:Item>Document.ВедомостьНаВыплатуЗарплаты</xr:Item>
				<xr:Item>Document.ПоступлениеДопРасходов</xr:Item>
				<xr:Item>Document.ПоступлениеНМА</xr:Item>
				<xr:Item>Document.СписаниеСРасчетногоСчета</xr:Item>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплатыВБанк</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалоговИПлатежейВБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалоговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПППлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПППолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречисленияВБюджет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПеречисленийВБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежнаяВедомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплатыВБанк</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/ИсправлениеБанковскихДокументовНаПеречислениеФизЛицам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПроверитьНаличиеНекорректныхБанковскихДокументов() Экспорт
	
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВыдачаЗаймаРаботнику);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеДепонентов);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗаработнойПлатыРаботнику);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеПодотчетномуЛицу);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПлатежноеПоручение.Ссылка КАК Документ,
	|	ПлатежноеПоручение.СчетКонтрагента КАК Счет
	|ПОМЕСТИТЬ ВТ_ПлатежныеПоручения_НекорректныйВладелец
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|ГДЕ
	|	ПлатежноеПоручение.ВидОперации В(&ВидыОпераций)
	|	И (ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 11, 1) <> "" ""
	|			ИЛИ ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 1, 1) = "" "")
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%Банк%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%""""%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%(%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%)%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%1%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%2%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%3%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%4%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%5%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%6%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%7%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%8%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%9%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%0%""
	|	И ПлатежноеПоручение.Контрагент <> ПлатежноеПоручение.СчетКонтрагента.Владелец
	|	И ПлатежноеПоручение.СчетКонтрагента <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|	И НЕ ПлатежноеПоручение.СчетКонтрагента.Владелец ССЫЛКА Справочник.Организации
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлатежноеПоручение.Ссылка,
	|	ПлатежноеПоручение.СчетКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПлатежноеПоручение.Ссылка КАК Документ
	|ПОМЕСТИТЬ ВТ_ПлатежныеПоручения_КорректныйВладелец
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение,
	|	ВТ_ПлатежныеПоручения_НекорректныйВладелец КАК ВТ_ПлатежныеПоручения_НекорректныйВладелец
	|ГДЕ
	|	ПлатежноеПоручение.ВидОперации В(&ВидыОпераций)
	|	И (ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 11, 1) <> "" ""
	|			ИЛИ ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 1, 1) = "" "")
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%Банк%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%""""%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%(%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%)%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%1%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%2%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%3%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%4%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%5%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%6%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%7%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%8%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%9%""
	|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%0%""
	|	И ПлатежноеПоручение.Контрагент = ПлатежноеПоручение.СчетКонтрагента.Владелец
	|	И ПлатежноеПоручение.СчетКонтрагента В
	|			(ВЫБРАТЬ
	|				ВТ_ПлатежныеПоручения_НекорректныйВладелец.Счет
	|			ИЗ
	|				ВТ_ПлатежныеПоручения_НекорректныйВладелец КАК ВТ_ПлатежныеПоручения_НекорректныйВладелец)
	|	И ПлатежноеПоручение.СчетКонтрагента <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|	И НЕ ПлатежноеПоручение.СчетКонтрагента.Владелец ССЫЛКА Справочник.Организации
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлатежноеПоручение.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВТ_ПлатежныеПоручения_НекорректныйВладелец.Документ
	|ПОМЕСТИТЬ ВТ_НекорректныеДокументы
	|ИЗ
	|	ВТ_ПлатежныеПоручения_НекорректныйВладелец КАК ВТ_ПлатежныеПоручения_НекорректныйВладелец
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПлатежныеПоручения_НекорректныйВладелец.Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПлатежныеПоручения_КорректныйВладелец.Документ
	|ИЗ
	|	ВТ_ПлатежныеПоручения_КорректныйВладелец КАК ВТ_ПлатежныеПоручения_КорректныйВладелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВТ_НекорректныеДокументы.Документ КАК Документ
	|ИЗ
	|	ВТ_НекорректныеДокументы КАК ВТ_НекорректныеДокументы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НекорректныеДокументы.Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлатежноеПоручение.Ссылка
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|ГДЕ
	|	ПлатежноеПоручение.ВидОперации В(&ВидыОпераций)
	|	И ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 10, 1) <> "" ""
	|	И ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 11, 1) = "" ""
	|	И ПлатежноеПоручение.СчетКонтрагента <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|	И НЕ ПлатежноеПоручение.СчетКонтрагента.Владелец ССЫЛКА Справочник.Организации
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлатежноеПоручение.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлатежноеПоручение.Ссылка
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|ГДЕ
	|	ПлатежноеПоручение.ВидОперации В(&ВидыОпераций)
	|	И ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 1, 1) = "" ""
	|	И (ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%Банк%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%""""%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%(%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%)%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%1%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%2%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%3%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%4%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%5%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%6%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%7%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%8%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%9%""
	|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%0%"")
	|	И ПлатежноеПоручение.СчетКонтрагента <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|	И НЕ ПлатежноеПоручение.СчетКонтрагента.Владелец ССЫЛКА Справочник.Организации
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлатежноеПоручение.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	Параметры.Вставить("ПоказатьИсправлениеБанковскихДокументовНаПеречислениеФизЛицам", ПроверитьНаличиеНекорректныхБанковскихДокументов());
	
КонецПроцедуры

Процедура ПроверитьДанные(ПараметрыПроверки, АдресХранилища) Экспорт
	
	РезультатВыполнения = Новый Структура;
	
	Если ПараметрыПроверки.Свойство("ВидПроверки") Тогда
		ВидПроверки = ПараметрыПроверки.ВидПроверки;
	Иначе
		ВидПроверки = Неопределено 
	КонецЕсли;
	
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВыдачаЗаймаРаботнику);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеДепонентов);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗаработнойПлатыРаботнику);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеПодотчетномуЛицу);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций);
	
	Если ВидПроверки = Неопределено ИЛИ ВидПроверки = 1 Тогда
		
		// проверка некорректного владельца банковскокго счета
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлатежноеПоручение.Контрагент КАК Получатель,
		|	ПлатежноеПоручение.СчетКонтрагента КАК Счет,
		|	ПлатежноеПоручение.Ссылка КАК Документ,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ПлатежноеПоручение.Контрагент.ФИО = """"
		|				ТОГДА ПлатежноеПоручение.Контрагент.Наименование
		|			ИНАЧЕ ПлатежноеПоручение.Контрагент.ФИО
		|		КОНЕЦ + "" (ИНН: "" + ПлатежноеПоручение.Контрагент.ИНН + ""; код: "" + ПлатежноеПоручение.Контрагент.Код + "")"" КАК СТРОКА(300)) КАК ПолучательПредставление,
		|	ЛОЖЬ КАК ЭтоВладелецСчета,
		|	НЕОПРЕДЕЛЕНО КАК Контрагент,
		|	ЛОЖЬ КАК Отметка,
		|	ВЫРАЗИТЬ(ПлатежноеПоручение.СчетКонтрагента.Наименование + "" (код: "" + ПлатежноеПоручение.СчетКонтрагента.Код + "")"" КАК СТРОКА(300)) КАК СчетПредставление
		|ПОМЕСТИТЬ ВТ_ПлатежныеПоручения_НекорректныйВладелец
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|ГДЕ
		|	ПлатежноеПоручение.ВидОперации В(&ВидыОпераций)
		|	И (ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 11, 1) <> "" ""
		|			ИЛИ ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 1, 1) = "" "")
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%Банк%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%""""%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%(%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%)%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%1%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%2%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%3%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%4%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%5%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%6%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%7%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%8%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%9%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%0%""
		|	И ПлатежноеПоручение.Контрагент <> ПлатежноеПоручение.СчетКонтрагента.Владелец
		|	И ПлатежноеПоручение.СчетКонтрагента <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|	И НЕ ПлатежноеПоручение.СчетКонтрагента.Владелец ССЫЛКА Справочник.Организации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлатежноеПоручение.Контрагент КАК Получатель,
		|	ПлатежноеПоручение.СчетКонтрагента КАК Счет,
		|	ПлатежноеПоручение.Ссылка КАК Документ,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ПлатежноеПоручение.Контрагент.ФИО = """"
		|				ТОГДА ПлатежноеПоручение.Контрагент.Наименование
		|			ИНАЧЕ ПлатежноеПоручение.Контрагент.ФИО
		|		КОНЕЦ + "" (ИНН: "" + ПлатежноеПоручение.Контрагент.ИНН + ""; код: "" + ПлатежноеПоручение.Контрагент.Код + "") - текущий владелец счета"" КАК СТРОКА(300)) КАК ПолучательПредставление,
		|	ИСТИНА КАК ЭтоВладелецСчета,
		|	НЕОПРЕДЕЛЕНО КАК Контрагент,
		|	ЛОЖЬ КАК Отметка,
		|	ВЫРАЗИТЬ(ПлатежноеПоручение.СчетКонтрагента.Наименование + "" (код: "" + ПлатежноеПоручение.СчетКонтрагента.Код + "")"" КАК СТРОКА(300)) КАК СчетПредставление
		|ПОМЕСТИТЬ ВТ_ПлатежныеПоручения_КорректныйВладелец
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение,
		|	ВТ_ПлатежныеПоручения_НекорректныйВладелец КАК ВТ_ПлатежныеПоручения_НекорректныйВладелец
		|ГДЕ
		|	ПлатежноеПоручение.ВидОперации В(&ВидыОпераций)
		|	И (ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 11, 1) <> "" ""
		|			ИЛИ ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 1, 1) = "" "")
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%Банк%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%""""%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%(%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%)%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%1%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%2%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%3%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%4%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%5%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%6%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%7%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%8%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%9%""
		|	И НЕ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%0%""
		|	И ПлатежноеПоручение.Контрагент = ПлатежноеПоручение.СчетКонтрагента.Владелец
		|	И ПлатежноеПоручение.СчетКонтрагента В
		|			(ВЫБРАТЬ
		|				ВТ_ПлатежныеПоручения_НекорректныйВладелец.Счет
		|			ИЗ
		|				ВТ_ПлатежныеПоручения_НекорректныйВладелец КАК ВТ_ПлатежныеПоручения_НекорректныйВладелец)
		|	И ПлатежноеПоручение.СчетКонтрагента <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|	И НЕ ПлатежноеПоручение.СчетКонтрагента.Владелец ССЫЛКА Справочник.Организации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПлатежныеПоручения_НекорректныйВладелец.Получатель,
		|	ВТ_ПлатежныеПоручения_НекорректныйВладелец.Счет,
		|	ВТ_ПлатежныеПоручения_НекорректныйВладелец.Документ,
		|	ВТ_ПлатежныеПоручения_НекорректныйВладелец.ПолучательПредставление,
		|	ВТ_ПлатежныеПоручения_НекорректныйВладелец.ЭтоВладелецСчета,
		|	ВТ_ПлатежныеПоручения_НекорректныйВладелец.Контрагент,
		|	ВТ_ПлатежныеПоручения_НекорректныйВладелец.Отметка,
		|	ВТ_ПлатежныеПоручения_НекорректныйВладелец.СчетПредставление
		|ПОМЕСТИТЬ ВТ_НекорректныеДокументы
		|ИЗ
		|	ВТ_ПлатежныеПоручения_НекорректныйВладелец КАК ВТ_ПлатежныеПоручения_НекорректныйВладелец
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПлатежныеПоручения_КорректныйВладелец.Получатель,
		|	ВТ_ПлатежныеПоручения_КорректныйВладелец.Счет,
		|	ВТ_ПлатежныеПоручения_КорректныйВладелец.Документ,
		|	ВТ_ПлатежныеПоручения_КорректныйВладелец.ПолучательПредставление,
		|	ВТ_ПлатежныеПоручения_КорректныйВладелец.ЭтоВладелецСчета,
		|	ВТ_ПлатежныеПоручения_КорректныйВладелец.Контрагент,
		|	ВТ_ПлатежныеПоручения_КорректныйВладелец.Отметка,
		|	ВТ_ПлатежныеПоручения_КорректныйВладелец.СчетПредставление
		|ИЗ
		|	ВТ_ПлатежныеПоручения_КорректныйВладелец КАК ВТ_ПлатежныеПоручения_КорректныйВладелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НекорректныеДокументы.Получатель КАК Получатель,
		|	ВТ_НекорректныеДокументы.Счет КАК Счет,
		|	ВТ_НекорректныеДокументы.Документ КАК Документ,
		|	ВТ_НекорректныеДокументы.ПолучательПредставление,
		|	ВТ_НекорректныеДокументы.ЭтоВладелецСчета,
		|	ВТ_НекорректныеДокументы.Контрагент,
		|	ВТ_НекорректныеДокументы.Отметка,
		|	ВТ_НекорректныеДокументы.СчетПредставление КАК СчетПредставление
		|ИЗ
		|	ВТ_НекорректныеДокументы КАК ВТ_НекорректныеДокументы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НекорректныеДокументы.Счет,
		|	ВТ_НекорректныеДокументы.Получатель,
		|	ВТ_НекорректныеДокументы.Документ,
		|	ВТ_НекорректныеДокументы.ПолучательПредставление,
		|	ВТ_НекорректныеДокументы.ЭтоВладелецСчета,
		|	ВТ_НекорректныеДокументы.Контрагент,
		|	ВТ_НекорректныеДокументы.Отметка,
		|	ВТ_НекорректныеДокументы.СчетПредставление
		|
		|УПОРЯДОЧИТЬ ПО
		|	Счет,
		|	СчетПредставление,
		|	Получатель,
		|	Документ";
		
		ТЧ_ЗарплатныеПроекты = Запрос.Выполнить().Выгрузить();
		
		РезультатВыполнения.Вставить("ТЧ_ЗарплатныеПроекты", ТЧ_ЗарплатныеПроекты);
		
	КонецЕсли;
	
	Если ВидПроверки = Неопределено ИЛИ ВидПроверки = 2 Тогда
		
		// проверка некорректного контрагента-физического лица - владельца банковскокго счета
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлатежноеПоручение.Контрагент КАК Получатель,
		|	ПлатежноеПоручение.СчетКонтрагента КАК Счет,
		|	ПлатежноеПоручение.Ссылка КАК Документ,
		|	ЛОЖЬ КАК Отметка,
		|	НЕОПРЕДЕЛЕНО КАК Контрагент,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ПлатежноеПоручение.Контрагент.ФИО = """"
		|				ТОГДА ПлатежноеПоручение.Контрагент.Наименование
		|			ИНАЧЕ ПлатежноеПоручение.Контрагент.ФИО
		|		КОНЕЦ + "" (ИНН: "" + ПлатежноеПоручение.Контрагент.ИНН + ""; код: "" + ПлатежноеПоручение.Контрагент.Код + "")"" КАК СТРОКА(300)) КАК ПолучательПредставление,
		|	ЛОЖЬ КАК ЭтоВладелецСчета,
		|	ВЫРАЗИТЬ(ПлатежноеПоручение.СчетКонтрагента.Наименование + "" (код: "" + ПлатежноеПоручение.СчетКонтрагента.Код + "")"" КАК СТРОКА(300)) КАК СчетПредставление
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|ГДЕ
		|	ПлатежноеПоручение.ВидОперации В(&ВидыОпераций)
		|	И ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 10, 1) <> "" ""
		|	И ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 11, 1) = "" ""
		|	И ПлатежноеПоручение.СчетКонтрагента <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|	И НЕ ПлатежноеПоручение.СчетКонтрагента.Владелец ССЫЛКА Справочник.Организации
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлатежноеПоручение.СчетКонтрагента,
		|	ПлатежноеПоручение.Контрагент,
		|	ПлатежноеПоручение.Ссылка,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ПлатежноеПоручение.Контрагент.ФИО = """"
		|				ТОГДА ПлатежноеПоручение.Контрагент.Наименование
		|			ИНАЧЕ ПлатежноеПоручение.Контрагент.ФИО
		|		КОНЕЦ + "" (ИНН: "" + ПлатежноеПоручение.Контрагент.ИНН + ""; код: "" + ПлатежноеПоручение.Контрагент.Код + "")"" КАК СТРОКА(300)),
		|	ВЫРАЗИТЬ(ПлатежноеПоручение.СчетКонтрагента.Наименование + ""( код: "" + ПлатежноеПоручение.СчетКонтрагента.Код + "")"" КАК СТРОКА(300)),
		|	ВЫРАЗИТЬ(ПлатежноеПоручение.СчетКонтрагента.Наименование + "" (код: "" + ПлатежноеПоручение.СчетКонтрагента.Код + "")"" КАК СТРОКА(300))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Счет,
		|	СчетПредставление,
		|	Получатель,
		|	Документ";
		
		ТЧ_КонтрагентыФизическиеЛица = Запрос.Выполнить().Выгрузить();
		
		РезультатВыполнения.Вставить("ТЧ_КонтрагентыФизическиеЛица", ТЧ_КонтрагентыФизическиеЛица);
		
	КонецЕсли;
	
	Если ВидПроверки = Неопределено ИЛИ ВидПроверки = 3 Тогда
		
		// проверка некорректного контрагента-физического лица - владельца банковскокго счета
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлатежноеПоручение.Контрагент КАК Получатель,
		|	ПлатежноеПоручение.СчетКонтрагента КАК Счет,
		|	ПлатежноеПоручение.Ссылка КАК Документ,
		|	ЛОЖЬ КАК Отметка,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ПлатежноеПоручение.Контрагент.ФИО = """"
		|				ТОГДА ПлатежноеПоручение.Контрагент.Наименование
		|			ИНАЧЕ ПлатежноеПоручение.Контрагент.ФИО
		|		КОНЕЦ + "" (ИНН: "" + ПлатежноеПоручение.Контрагент.ИНН + ""; код: "" + ПлатежноеПоручение.Контрагент.Код + "")"" КАК СТРОКА(300)) КАК ПолучательПредставление,
		|	ЛОЖЬ КАК ЭтоВладелецСчета,
		|	ВЫРАЗИТЬ(ПлатежноеПоручение.СчетКонтрагента.Наименование + "" (код: "" + ПлатежноеПоручение.СчетКонтрагента.Код + "")"" КАК СТРОКА(300)) КАК СчетПредставление
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|ГДЕ
		|	ПлатежноеПоручение.ВидОперации В(&ВидыОпераций)
		|	И ПОДСТРОКА(ПлатежноеПоручение.Контрагент.ИНН, 1, 1) = "" ""
		|	И (ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%Банк%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%""""%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%(%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%)%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%1%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%2%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%3%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%4%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%5%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%6%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%7%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%8%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%9%""
		|			ИЛИ ПлатежноеПоручение.Контрагент.ФИО ПОДОБНО ""%0%"")
		|	И ПлатежноеПоручение.СчетКонтрагента <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|	И НЕ ПлатежноеПоручение.СчетКонтрагента.Владелец ССЫЛКА Справочник.Организации
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлатежноеПоручение.Ссылка,
		|	ПлатежноеПоручение.Контрагент,
		|	ПлатежноеПоручение.СчетКонтрагента,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ПлатежноеПоручение.Контрагент.ФИО = """"
		|				ТОГДА ПлатежноеПоручение.Контрагент.Наименование
		|			ИНАЧЕ ПлатежноеПоручение.Контрагент.ФИО
		|		КОНЕЦ + "" (ИНН: "" + ПлатежноеПоручение.Контрагент.ИНН + ""; код: "" + ПлатежноеПоручение.Контрагент.Код + "")"" КАК СТРОКА(300)),
		|	ВЫРАЗИТЬ(ПлатежноеПоручение.СчетКонтрагента.Наименование + ""( код: "" + ПлатежноеПоручение.СчетКонтрагента.Код + "")"" КАК СТРОКА(300)),
		|	ВЫРАЗИТЬ(ПлатежноеПоручение.СчетКонтрагента.Наименование + "" (код: "" + ПлатежноеПоручение.СчетКонтрагента.Код + "")"" КАК СТРОКА(300))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Счет,
		|	СчетПредставление,
		|	Получатель,
		|	Документ";
		
		ТЧ_ВозможныеКонтрагентыФизическиеЛица = Запрос.Выполнить().Выгрузить();
		
		РезультатВыполнения.Вставить("ТЧ_ВозможныеКонтрагентыФизическиеЛица", ТЧ_ВозможныеКонтрагентыФизическиеЛица);
	КонецЕсли;
	
	РезультатВыполнения.Вставить("ВидПроверки", ВидПроверки);
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
КонецПроцедуры

Процедура ИсправитьДанные(ПараметрыИсправления, АдресХранилища) Экспорт
	
	РезультатВыполнения = Новый Структура;
	
	ВидИсправления = ПараметрыИсправления.ВидИсправления;
	СтрокиДерева   = ПараметрыИсправления.СтрокиДерева.Строки;
	
	Для Каждого ТекущаяВетка ИЗ СтрокиДерева Цикл
		Если ТекущаяВетка.Отметка Тогда
			Если ЗначениеЗаполнено(ТекущаяВетка.Контрагент) Тогда
				
				// Шаг 1. Замена владельца счета
				СчетОбъект = ТекущаяВетка.Счет.ПолучитьОбъект();
				СчетОбъект.Владелец = ТекущаяВетка.Контрагент;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СчетОбъект);
				
				ВложенныеСтроки = ТекущаяВетка.Строки;
				Для Каждого Строка ИЗ ВложенныеСтроки Цикл
					// Шаг 2.1. Замена получателя в документах
					ДокументОбъект = Строка.Документ.ПолучитьОбъект();
					ДокументОбъект.Контрагент = ТекущаяВетка.Контрагент;
					// Шаг 2.2. Изменение вида операции в документах
					Если ТипЗнч(ТекущаяВетка.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
						ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочееСписание;
					КонецЕсли;
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
					
				КонецЦикла;
				
			Иначе
				ТекстСообщения =
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для счета: %1 не указан новый контрагент! Документы по счету не обработаны.'"),
				ТекущаяВетка.Счет);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	РезультатВыполнения.Вставить("ВидИсправления", ВидИсправления);
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
КонецПроцедуры

#КонецЕсли
